In [11]:
import pandas as pd
import numpy as np
dll=pd.DataFrame([[1,2,3],[4,5,6]],columns=['a','b','c'],index=['i','ii'])
print(dll)
ddl=pd.DataFrame({'a':[1,2,3],'b':[4,5,6]})
print(ddl)
ddl=pd.DataFrame({'a':[1,2,3],'b':[4,5,6]},index=['x','y','z'])
print(ddl)
dld=pd.DataFrame([{'a':1},{'b':2}])
print(dld)
dld1=pd.DataFrame([{'a':1},{'b':2}],index=['first row','second row'])
print(dld1)
dld2=pd.DataFrame([{'a':1},{'b':2}],index=['first row','second row'],columns=['col1','col2'])
print(dld2)

    a  b  c
i   1  2  3
ii  4  5  6
   a  b
0  1  4
1  2  5
2  3  6
   a  b
x  1  4
y  2  5
z  3  6
     a    b
0  1.0  NaN
1  NaN  2.0
              a    b
first row   1.0  NaN
second row  NaN  2.0
            col1  col2
first row    NaN   NaN
second row   NaN   NaN

In [21]:
dlt=pd.DataFrame([(1,2,3),(4,5,6)])
print(dlt)
l=['saleem','basha']
age=[20,19]
zipped=tuple(zip(l,age))
print(zipped)
a,b=list(zip(*zipped))
print(a)
print(b)
dzip=pd.DataFrame(zip(l,age))
print(dzip)
empty=pd.DataFrame()
print(empty)

   0  1  2
0  1  2  3
1  4  5  6
(('saleem', 20), ('basha', 19))
('saleem', 'basha')
(20, 19)
        0   1
0  saleem  20
1   basha  19
Empty DataFrame
Columns: []
Index: []

In [32]:
sort_df=pd.DataFrame({'a':[3,1,2],'b':[5,6,4]})
print(sort_df)
print(sort_df.sort_values(by='b',ascending=False))

   a  b
0  3  5
1  1  6
2  2  4
   a  b
1  1  6
0  3  5
2  2  4

In [36]:
print(sort_df.max())

a    3
b    6
dtype: int64

In [44]:
dupli=pd.DataFrame({'a':[1,1,2],'b':[3,3,5]})
print(dupli)
print(dupli.a.unique())
dupli.a.nunique()

   a  b
0  1  3
1  1  3
2  2  5
[1 2]

2

In [47]:
print(dupli)
print(dupli.drop_duplicates())

   a  b
0  1  3
1  1  3
2  2  5
   a  b
0  1  3
2  2  5
   a  b
0  1  3
1  1  3
2  2  5

In [55]:
print(dupli)
dupli.rename(columns={'a':'A','b':'B'},inplace=True)
print(dupli)

   a  b
0  1  3
1  1  3
2  2  5
   A  B
0  1  3
1  1  3
2  2  5

In [73]:
print(dupli)
dupli.where(dupli==1)

   a  b
0  1  3
1  1  3
2  2  5

     a   b
0  1.0 NaN
1  1.0 NaN
2  NaN NaN

In [77]:
print(dupli.drop([1],inplace=False))
print(dupli)

   a  b
0  1  3
2  2  5
   a  b
0  1  3
1  1  3
2  2  5

In [78]:
dupli.drop('a',axis=1)

   b
0  3
1  3
2  5

In [79]:
print(dupli)

   a  b
0  1  3
1  1  3
2  2  5

In [80]:
df = pd.DataFrame(np.array(([2, 3, 4], [5, 6, 7])),
                  index=['tiger', 'lion'],
                  columns=['one', 'two', 'three'])
df.filter(items=['one', 'three'])

       one  three
tiger    2      4
lion     5      7

In [81]:
df.filter(regex='e$', axis=1)

       one  three
tiger    2      4
lion     5      7

In [82]:
df.filter(like='ion', axis=0)

      one  two  three
lion    5    6      7

In [86]:
moving_averages=pd.DataFrame({'year':[1966,1967,1968,1969,1970,1971,1972,1973,1974,1975,1976,1977,1978,1979,1980,1981,1982],'sales':[19.3,20.9,17.8,16.1,17.6,17.8,18.3,17.3,21.4,19.3,18.1,19.5,19.2,22.2,20.9,21.5,21.9]})
moving_averages['sales'].rolling(5).mean()

0       NaN
1       NaN
2       NaN
3       NaN
4     18.34
5     18.04
6     17.52
7     17.42
8     18.48
9     18.82
10    18.88
11    19.12
12    19.50
13    19.66
14    19.98
15    20.66
16    21.14
Name: sales, dtype: float64

In [87]:
normal = pd.DataFrame({'Column 1':[200,-4,90,13.9,5,
                               -90,20,300.7,30,-200,400],
                     
                   'Column 2':[20,30,23,45,19,38,
                               25,45,34,37,12]})
print(normal)
normal['Column 1'] = normal['Column 1'] /normal['Column 1'].abs().max()
display(normal)

    Column 1  Column 2
0      200.0        20
1       -4.0        30
2       90.0        23
3       13.9        45
4        5.0        19
5      -90.0        38
6       20.0        25
7      300.7        45
8       30.0        34
9     -200.0        37
10     400.0        12

    Column 1  Column 2
0    0.50000        20
1   -0.01000        30
2    0.22500        23
3    0.03475        45
4    0.01250        19
5   -0.22500        38
6    0.05000        25
7    0.75175        45
8    0.07500        34
9   -0.50000        37
10   1.00000        12

In [98]:
print(normal)
normal['Column 3']=list(np.arange(13))
print(normal)

    Column 1  Column 2  Column 3
0    0.50000        20         0
1   -0.01000        30         1
2    0.22500        23         2
3    0.03475        45         3
4    0.01250        19         4
5   -0.22500        38         5
6    0.05000        25         6
7    0.75175        45         7
8    0.07500        34         8
9   -0.50000        37         9
10   1.00000        12        10
11  10.00000        87        92
12  10.00000        87        92
    Column 1  Column 2  Column 3
0    0.50000        20         0
1   -0.01000        30         1
2    0.22500        23         2
3    0.03475        45         3
4    0.01250        19         4
5   -0.22500        38         5
6    0.05000        25         6
7    0.75175        45         7
8    0.07500        34         8
9   -0.50000        37         9
10   1.00000        12        10
11  10.00000        87        11
12  10.00000        87        12

In [101]:
ranks= pd.DataFrame(data={'Animal': ['fox', 'Kangaroo', 'deer',
                                   'spider', 'snake'],
                        'Number_legs': [4, 2, 4, 8, np.nan]})
print(ranks)
ranks['ascending ranks']=ranks['Number_legs'].rank()
print(ranks)
ranks['descending ranks']=ranks['Number_legs'].rank(ascending=False)
print(ranks)

     Animal  Number_legs
0       fox          4.0
1  Kangaroo          2.0
2      deer          4.0
3    spider          8.0
4     snake          NaN
     Animal  Number_legs  ascending ranks
0       fox          4.0              2.5
1  Kangaroo          2.0              1.0
2      deer          4.0              2.5
3    spider          8.0              4.0
4     snake          NaN              NaN
     Animal  Number_legs  ascending ranks  descending ranks
0       fox          4.0              2.5               2.5
1  Kangaroo          2.0              1.0               4.0
2      deer          4.0              2.5               2.5
3    spider          8.0              4.0               1.0
4     snake          NaN              NaN               NaN

In [99]:
new_row = {'Column 1':10, 'Column 2':87, 'Column 3':92}#append row to the dataframe
normal = normal.append(new_row, ignore_index=True)
print(normal)

    Column 1  Column 2  Column 3
0    0.50000        20         0
1   -0.01000        30         1
2    0.22500        23         2
3    0.03475        45         3
4    0.01250        19         4
5   -0.22500        38         5
6    0.05000        25         6
7    0.75175        45         7
8    0.07500        34         8
9   -0.50000        37         9
10   1.00000        12        10
11  10.00000        87        11
12  10.00000        87        12
13  10.00000        87        92

C:\Users\sbash\AppData\Local\Temp\ipykernel_17596\3628505712.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  normal = normal.append(new_row, ignore_index=True)